#### `terragrunt plan` Success
<details><summary>Show Output</summary>

```
random_password.password: Refreshing state... [id=none]
module.saml-app.okta_app_saml.saml_app["deserthomescleaning.com"]: Refreshing state... [id=0oa3i755ftmbP4v6M5d7]
googleworkspace_user.users["test2@deserthomescleaning.com"]: Refreshing state... [id=105537542681008357463]
googleworkspace_role_assignment.role_assignment["_GROUPS_ADMIN_ROLE-test2@deserthomescleaning.com"]: Refreshing state... [id=43548224702644281]
module.saml-app.okta_app_user.user_assignments["deserthomescleaning.com-test2@deserthomescleaning.com"]: Refreshing state... [id=00u3hyo5edWi9WbdV5d7]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # googleworkspace_role_assignment.role_assignment["_GROUPS_ADMIN_ROLE-test@deserthomescleaning.com"] will be created
  + resource "googleworkspace_role_assignment" "role_assignment" {
      + assigned_to = (known after apply)
      + etag        = (known after apply)
      + id          = (known after apply)
      + role_id     = "43548224702644225"
      + scope_type  = "CUSTOMER"
    }

  # googleworkspace_role_assignment.role_assignment["_USER_MANAGEMENT_ADMIN_ROLE-test@deserthomescleaning.com"] will be created
  + resource "googleworkspace_role_assignment" "role_assignment" {
      + assigned_to = (known after apply)
      + etag        = (known after apply)
      + id          = (known after apply)
      + role_id     = "43548224702644227"
      + scope_type  = "CUSTOMER"
    }

  # googleworkspace_user.users["test@deserthomescleaning.com"] will be created
  + resource "googleworkspace_user" "users" {
      + agreed_to_terms                    = (known after apply)
      + creation_time                      = (known after apply)
      + customer_id                        = (known after apply)
      + deletion_time                      = (known after apply)
      + etag                               = (known after apply)
      + id                                 = (known after apply)
      + include_in_global_address_list     = true
      + is_admin                           = (known after apply)
      + is_delegated_admin                 = (known after apply)
      + is_enforced_in_2_step_verification = (known after apply)
      + is_enrolled_in_2_step_verification = (known after apply)
      + is_mailbox_setup                   = (known after apply)
      + last_login_time                    = (known after apply)
      + non_editable_aliases               = (known after apply)
      + org_unit_path                      = (known after apply)
      + password                           = (sensitive value)
      + primary_email                      = "test@deserthomescleaning.com"
      + suspension_reason                  = (known after apply)
      + thumbnail_photo_etag               = (known after apply)
      + thumbnail_photo_url                = (known after apply)

      + languages {
          + custom_language = (known after apply)
          + language_code   = (known after apply)
          + preference      = (known after apply)
        }

      + name {
          + family_name = "User"
          + full_name   = (known after apply)
          + given_name  = "Test"
        }
    }

  # module.saml-app.okta_app_saml.saml_app["deserthomescleaning.com"] will be updated in-place
  ~ resource "okta_app_saml" "saml_app" {
      ~ app_links_json             = jsonencode(
          ~ {
              ~ accounts = false -> true
                # (5 unchanged elements hidden)
            }
        )
        id                         = "0oa3i755ftmbP4v6M5d7"
        name                       = "google"
        # (28 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.saml-app.okta_app_user.user_assignments["deserthomescleaning.com-test@deserthomescleaning.com"] will be created
  + resource "okta_app_user" "user_assignments" {
      + app_id              = "0oa3i755ftmbP4v6M5d7"
      + has_shared_username = (known after apply)
      + id                  = (known after apply)
      + retain_assignment   = false
      + user_id             = "00u3jhvgcsexZxvth5d7"
      + username            = "test@deserthomescleaning.com"
    }

Plan: 4 to add, 1 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named
│ "vault_github_secrets_path" but a value was found in file
│ "/github/workspace/staging/accounts/google-workspaces/../../../common.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "github_api_token" but a
│ value was found in file
│ "/github/workspace/staging/accounts/google-workspaces/../../../common.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Values for undeclared variables
│ 
│ In addition to the other similar warnings shown, 8 other variable(s)
│ defined without being declared.
╵

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
time=2022-01-09T09:59:15Z level=error msg=1 error occurred:
	* exit status 2
```

</details>

*Workflow: `Terragrunt Google-workspaces App`, Action: `__the-commons-project_terragrunt-github-actions_4`, Working Directory: `./staging/accounts/google-workspaces/`, Workspace: `default`*
